# 1. Копирование базового образа Node.js (чужой код и ОС)
FROM node:22.11.0-alpine

# 2. Создание рабочей папки внутри контейнера
WORKDIR /app

# 3. Копирование файлов манифеста зависимостей
COPY package*.json ./

# 4. Запуск установки пакетов
RUN npm install

# 5. Копирование всего остального кода
COPY . .

# 6. Установка переменных окружения для режима production
ENV NODE_ENV=production
ENV PROTOCOL=http
ENV HOST=0.0.0.0
ENV PORT=10000

# 6. Открытие порта, который слушает Express-сервер
EXPOSE 10000

# 7. Команда, которая выполнится ПРИ ЗАПУСКЕ контейнера
CMD ["npm", "run", "prod"]
